{
    "data": [
        {
            "id": 1,
            "title": "Can't afford a six-figure sports car? These automakers are still making fun, affordable models",
            "date": "July 5, 2025, 6:00 PM",
            "content": "The sports car market may be shrinking, but there are still options out there for budget conscious drivers.\n\nDave Coleman, an engineering manager for Mazda, can list plenty of reasons why more Americans should get behind the wheel of the diminutive MX-5 Miata ($29,530).\n\nColeman takes his to the airport -- \"Buy luggage that has a soft side and put in the trunk, it's bigger than you think\" -- and successfully navigates California commuter traffic among the SUV and truck leviathans. Plus, at 6'2, he's proof that tall individuals can squeeze into a Miata without feeling crunched inside.\n\n\"There is so much boring stuff in our daily life ... so much of daily driving is not fun,\" Coleman told ABC News. \"Sports cars are an attainable way to enjoy your life. You can push the envelope with a sports car.\"\n\nColeman said the capable Miata, which has been around for 35 years, has earned its reputation as one of the top sports cars because of its affordability, lightness and buoyant personality. It's also one of the few sports cars on the market that has been able to withstand consumer trends, which haven't been favorable to two-seaters.\n\n\"You can drive the car at the limit without going so fast that you can't see through the corner,\" he said. \"The suspension is supple and soft and made for bumpy roads -- you can easily drive it in traffic. It's tuned for backroads, not the track. We sell as many as we build.\""
        },
        {
            "id":2,
            "title":"What's in Trump's trade agreement with the European Union?",
            "date":"July 29, 2025, 2:24 AM",
            "content":"President Donald Trump unveiled a trade agreement with the European Union on Sunday, making it the latest in a series of accords as the White House threatens to slap tariffs on dozens of countries this week.\n\nPrior to the agreement, the European Union faced the prospect of a 30% tariff rate set to take effect Aug. 1. Instead, products from one of the largest U.S. trade partners will be slapped with a 15% tariff.\n\nIn exchange, the EU said European companies would buy $750 billion worth of energy-related goods over three years and invest an extra $600 billion in the U.S.\n\nSpeaking to reporters on Sunday, Trump touted the agreement as the \"biggest deal ever made.\" The White House has yet to release full details of the accord.\n\nEuropean Commission President Ursula von der Leyen said the agreement \"creates certainty in uncertain times. It delivers stability and predictability for citizens and businesses on both sides of the Atlantic.\""
        }
    ]
}